{
	"articles": [
		{
			"id": "1",
			"title": "Wittgenstein's Legacy: The Principles of the Private Language Arguments",
			"userId": "1",
			"text": "In the absence of a crystal ball, one cannot say what Wittgenstein's role in 21st century philosophy will be. But one can attempt to articulate his philosophical legacy to the 21st century. As he remarked early in the 1930s, ‘a new method has been found’. Of course, that a new method has been found does not mean that people will use it, or even understand how to apply it.",
			"createdAt": "7/20/2019, 5:15:03 PM"
		},
		{
			"id": "2",
			"title": "Bypassing anti-incognito detection in Google Chrome",
			"userId": "1",
			"text": "Incognito or private browsing is present in all modern browsers. This mode helps people avoid unwanted cookies, stateful trackers and is also useful in reading articles on newspaper websites since some of them limit the users to a certain number of free articles per day or simply block access if opened in incognito mode.",
			"createdAt": "7/20/2019, 5:15:03 PM"
		},
		{
			"id": "3",
			"title": "Centenarian Radio Amateur’s Efforts Helped Pave the Way to the Moon",
			"userId": "2",
			"text": "07/18/2019 \nThe Nashville Tennessean newspaper recently featured the story of a 104-year-old ARRL member who contributed to NASA’s effort to put the first humans on the moon 50 years ago this month. Cary Nettles, W5SRR, of Columbia, Tennessee — who calls himself the nation’s oldest rocket scientist still alive — was a NASA project manager and research engineer on rocket propulsion systems in the 1950s and 1960s.",
			"createdAt": "7/20/2019, 5:15:03 PM"
		},
		{
			"id": "4",
			"title": "What a Newfound Kingdom Means for the Tree of Life",
			"userId": "1",
			"text": "From Quanta Magazine (find original story here). \nThe tree of life just got another major branch. Researchers recently found a certain rare and mysterious microbe called a hemimastigote in a clump of Nova Scotian soil. Their subsequent analysis of its DNA revealed that it was neither animal, plant, fungus nor any recognized type of protozoan—that it in fact fell far outside any of the known large categories for classifying complex forms of life (eukaryotes).",
			"createdAt": "7/20/2019, 5:15:03 PM"
		},
		{
			"id": "5",
			"title": "Grace and Favor",
			"userId": "3",
			"text": "Him: All I know is I’d be quite happy to be someone else on the off chance I’d be a genius, a great man. Yes, I have to admit it. There’s something there which speaks to me. I’ve never heard a single genius praised without such tributes to him making me secretly enraged. I get envious. When I learn about some detail of their private lives that demeans them, I listen with pleasure.",
			"createdAt": "7/20/2019, 5:15:03 PM"
		},
		{
			"id": "6",
			"title": "The Impossible Dream",
			"userId": "2",
			"text": "These words, from Thomas Jefferson’s Declaration of Independence, are so familiar that it is easy to assume their meaning is obvious. The puzzle lies in the assertion that we have a right to pursue happiness. John Locke, in his Two Treatises of 1690, said we are all created equal and have inalienable rights, including those to life and liberty. But for Locke the third crucial right was the right to property.",
			"createdAt": "7/20/2019, 5:15:03 PM"
		},
		{
			"id": "7",
			"title": "Government Work",
			"userId": "3",
			"text": "In the summer of 2016, a dizzying photograph from Chennai, in the Indian state of Tamil Nadu, circulated through international media outlets. The photo shows about a thousand Indian schoolchildren dressed in white and blue uniforms, their bodies arranged in rows of twos and fours and fives, their arms clasped in acute triangles above their heads. On the ground, there must have been pandemonium: young children, fatigued by the scorching June heat, confused by what they were doing or why they were being told to stand still.",
			"createdAt": "7/20/2019, 5:15:03 PM"
		}
	],
	"users": [
		{
			"id": "1",
			"name": "user first"
		},
		{
			"id": "2",
			"name": "user second"
		},
		{
			"id": "3",
			"name": "user third"
		}
	]
}
